IDEA Open Model
ResultBase Class
Compatible with IDEA StatiCa v 10.1
 Result base abstract class
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.ResultBase
 IdeaRS.OpenModel.Result.ResultOnSection
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.1.1 (10.1.1.1)
Syntax
public abstract class ResultBase
Public MustInherit Class ResultBase
public ref class ResultBase abstract
The ResultBase type exposes the following members.
Constructors
Name | Description
ResultBase
Initializes a new instance of the ResultBase class
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace